[
  {
    "bookId": "B001",
    "bookName": "The Night Circus",
    "author": "Erin Morgenstern",
    "image": "https://images2.penguinrandomhouse.com/cover/9780307744432",
    "review": "Erin Morgenstern's The Night Circus is an enchanting tapestry of atmosphere and magic that lingers long after the final page. Set around a travelling nocturnal circus called Le Cirque des Rêves, the novel centres on a slow-burning, high-stakes duel between two young illusionists bound by an arrangement made before they were born. Morgenstern's strength is atmosphere: the book is textured with sensory detail, from the smell of caramel and frost in the tents to the tactile oddities in the Clockmaker's shop. Characters arrive as almost-mythic figures—Tristian and Celia drive the stakes, but it's the ensemble (Chandresh, Poppet, Widget, and the teachers) who populate the circus with warmth and melancholy. The nonlinear structure is deliberate: fragments of present and memory assemble like the circus itself, revealing rules without spelling them out. The romance is quietly electrical, restrained but inevitable, and the book resists tidy closure in favor of a bittersweet, bittersweetly satisfying resolution. Where the novel occasionally lingers too long on poetic description, many readers will gladly lose themselves in Morgenstern's carefully constructed dream-world. For anyone craving immersive, lyrical fantasy with a human centre, The Night Circus remains a rare, spell-binding treat.",
    "totalPages": 400,
    "rating": 4.0,
    "category": "Fantasy / Magical Realism",
    "tags": ["Fantasy", "Magic Realism", "Romance", "Atmospheric"],
    "publisher": "Vintage / Anchor (US editions vary)",
    "yearOfPublishing": 2011
  },
  {
    "bookId": "B002",
    "bookName": "The Goldfinch",
    "author": "Donna Tartt",
    "image": "https://www.hachettebookgroup.com/wp-content/uploads/2024/01/9780316248679.jpg?resize=768,1376",
    "review": "Donna Tartt's The Goldfinch is an ambitious, Dickensian epic that follows Theo Decker from a tragic childhood in New York through a long, complicated apprenticeship in grief, art, and moral compromise. The inciting incident—a bombing at an art museum that kills Theo's mother—sets in motion a novel concerned with how a single object (the painting The Goldfinch) can anchor memory, guilt, and identity. Tartt's prose is meticulous and indulgent in the best sense: sentences unfurl, descriptions linger, and the moral texture of scenes—opulence, addiction, art markets—are rendered with uncanny precision. Critics have argued about length and pacing, but that scale is part of Tartt's method: she builds character through repeated, intimate scenes that cumulatively shape Theo's missteps and survival. The novel is a study in attachment: to people, to beauty, to possession. Its final act asks hard questions about redemption and the value of art beyond commerce. While not spare or modernist in style, The Goldfinch offers readers a fully realized world—flawed, intoxicating, and memorably alive—where pity and outrage sit side by side.",
    "totalPages": 771,
    "rating": 3.9,
    "category": "Literary Fiction",
    "tags": ["Bildungsroman", "Art", "Family", "Loss"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 2013
  },
  {
    "bookId": "B003",
    "bookName": "Normal People",
    "author": "Sally Rooney",
    "image": "https://www.faber.co.uk/wp-content/uploads/2021/09/9780571334650-450x690.jpg",
    "review": "Sally Rooney's Normal People is an intimate, unflinching portrait of emotional education in young adulthood. It follows Connell and Marianne—two teenagers from the same small Irish town whose social differences and private intimacies complicate their attempts to grow into themselves. Rooney writes with crystalline clarity about the ways power, class, and miscommunication shape relationships; the novel's power is in its accumulation of small, precise moments that reveal how affection and cruelty can coexist within long bonds. Dialogue-driven scenes feel immediate and authentic: Rooney captures the texture of contemporary thought, the way shame and desire interlock. The relationship depicted is not glorified; Rooney spares no detail of awkwardness and the slow erosion ordinary life can wreak on intimacy. At the same time, Normal People earns emotional payoff through recurrent reckoning and forgiveness—characters learn and fail and learn again. The novel's economy and psychological acuity made it a touchstone for millennial fiction, and its quiet intensity rewards readers who appreciate character-driven, realistic modern narratives.",
    "totalPages": 266,
    "rating": 3.8,
    "category": "Contemporary / Literary Fiction",
    "tags": ["Contemporary", "Romance", "Character-driven", "Ireland"],
    "publisher": "Faber & Faber",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "B004",
    "bookName": "The Testaments",
    "author": "Margaret Atwood",
    "image": "https://images2.penguinrandomhouse.com/cover/9780525562627",
    "review": "The Testaments returns readers to the world of Gilead, extending Atwood's iconic The Handmaid's Tale with new perspectives and generational consequences. Framed through three narrators—Aunt Lydia and two younger women—the novel expands the universe of Gilead while illuminating the mechanisms of power that sustain totalitarian control. Atwood's voice here is both forensic and mordant: she dissects institutional cruelty with a novelist's ear for motive and irony. The Testaments is less a direct sequel than a structural companion piece: it asks how complicity is manufactured and how resistance germinates within impossible constraints. The interplay of narrative forms—a testimony, secret documents, and the gleanings of unreliable narrators—keeps the reader off-balance in a productive way. While some readers hoped for a more revolutionary catharsis, the book's real achievement is its exploration of choices within coercive systems and the small, stubborn ways human empathy persists. Atwood balances bleakness with sly moral observation, producing a book that both deepens the original world and asks urgent questions about memory, responsibility, and the cost of survival.",
    "totalPages": 432,
    "rating": 4.0,
    "category": "Dystopian / Literary Fiction",
    "tags": ["Dystopia", "Political", "Feminism", "Speculative"],
    "publisher": "McClelland & Stewart / Nan A. Talese (US)",
    "yearOfPublishing": 2019
  },
  {
    "bookId": "B005",
    "bookName": "Klara and the Sun",
    "author": "Kazuo Ishiguro",
    "image": "https://images3.penguinrandomhouse.com/cover/9780593311295",
    "review": "Klara and the Sun is a quietly devastating meditation on consciousness, love, and what we owe one another. Narrated by Klara, an Artificial Friend designed to be an empathetic companion for children, Ishiguro invites readers to inhabit a perspective that is both naïve and deeply observant. Klara's language is plain and earnest; through her, the novel refracts human longing and the social machinery that creates emotional substitutes. The book asks thorny ethical questions without polemic: what counts as authentic love, and can artificial presence ever replace human risk and unpredictability? Ishiguro’s prose is economical, and the speculative trappings are a means to an emotional end—Klara’s devotion and the human characters’ vulnerabilities produce genuine poignancy. The world-building is subtle, the future intimated through cultural shifts rather than spreadsheets of tech. Ultimately the novel's quiet power comes from its moral imagination: Klara's capacity for hope is both moving and alarming, reminding readers that what we program reflects what we value. This is a gentle but morally fierce novel that lingers.",
    "totalPages": 320,
    "rating": 3.8,
    "category": "Speculative / Literary Fiction",
    "tags": ["Speculative", "AI", "Ethics", "Philosophical"],
    "publisher": "Faber & Faber / Knopf (US)",
    "yearOfPublishing": 2021
  },
  {
    "bookId": "B006",
    "bookName": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://images1.penguinrandomhouse.com/cover/9780593540480",
    "review": "Delia Owens' Where the Crawdads Sing blends lyrical nature writing with a murder mystery and a coming-of-age tale. The novel centers on Kya Clark, the 'Marsh Girl,' who grows up isolated in the North Carolina marshes, learning the language of birds and tides. Owens' strength is landscape: the marsh is rendered with exacting, evocative prose that makes the environment a character in its own right. Parallel narrative tracks—Kya's lonely childhood and the later investigation into a local man's death—create tension and slow revelation. The novel's exploration of loneliness, resilience, and the social stigma of being different grounds its plot in human feeling. Some readers have objected to the book's tidy denouement; others find the final act a moving confirmation of Kya's survival. Controversies surrounding the author's life surfaced after publication and complicate reception, but judged on craft, the novel succeeds in combining natural history detail with a readable, emotional story about belonging and the costs of ostracism.",
    "totalPages": 384,
    "rating": 4.1,
    "category": "Contemporary / Mystery",
    "tags": ["Nature", "Mystery", "Coming-of-age", "Southern"],
    "publisher": "G.P. Putnam's Sons",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "B007",
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://images3.penguinrandomhouse.com/cover/9780399590528",
    "review": "Educated is a powerful memoir about the wrenching costs and surprising gains of education. Tara Westover recounts growing up in a survivalist family in rural Idaho with little to no formal schooling, working in her father's junkyard and home-taught in a household skeptical of institutions. Her journey—to Brigham Young University, then to Cambridge and Harvard—reads as an intellectual awakening and a painful reckoning with family loyalty. Westover describes specific scenes of danger and deprivation with clarity: injuries left untreated, dangerous work, and a household culture that isolates and distrusts outsiders. What makes Educated exceptional is its moral subtlety: the book refuses to collapse into simple villainy or vindication. Westover interrogates memory, culpability, and the uneven burden of choosing oneself against kin. Her prose is crisp and emotionally candid; the narrative pulses with curiosity and hurt. The memoir raises questions about what we owe our origins and how knowledge can both liberate and estrange. It is at once inspirational and wrenchingly honest.",
    "totalPages": 352,
    "rating": 4.5,
    "category": "Memoir",
    "tags": ["Memoir", "Education", "Family", "Resilience"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "B008",
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://celadonbooks.com/wp-content/uploads/2019/07/the-silent-patient-us.jpg",
    "review": "The Silent Patient is a taut psychological thriller that hinges on an arresting central conceit: Alicia Berenson, a celebrated painter, shoots her husband and thereafter refuses to speak. Theo Faber, a psychotherapist obsessed with her case, seeks to unlock the motive behind her silence. Michaelides writes with an economy suited to a twist-driven plot, tightening the reader's focus around unreliable narrators, therapy transcripts, and journal fragments. The novel's strength is pacing: Michaelides steadily distributes fresh details that reframe prior assumptions, and the courtroom-of-the-mind atmosphere creates an addictive forward momentum. Some readers may find the final twist sensational, others ingenious; either way, it reframes the psychological plumbing the book has been excavating. The Silent Patient successfully blends clinical detail with domestic unease, and while it plays with genre conventions, it remains grounded in character—the wounded profession of therapy, the ethics of manipulation, and the lengths someone will go to bury a memory. For readers who enjoy carefully plotted suspense with psychological depth, this debut delivers.",
    "totalPages": 325,
    "rating": 4.0,
    "category": "Psychological Thriller",
    "tags": ["Thriller", "Mystery", "Psychological", "Twist"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "bookId": "B009",
    "bookName": "The Midnight Library",
    "author": "Matt Haig",
    "image": "https://images4.penguinrandomhouse.com/cover/9780525559498",
    "review": "Matt Haig's The Midnight Library is a hopeful, philosophical fable about regret, choices, and the search for meaning. Nora Seed, dissatisfied with her life, finds herself in a liminal library between life and death; each book corresponds to an alternate life she might have lived had she made different choices. The narrative is built around the simple but effective device of choice-as-world, and Haig uses it to explore mental health and the lie that there is a single 'right' life. The book is earnest and accessible: its sentences are direct, its emotional appeals deliberate, and its ethical reflections aimed at readers who appreciate consolatory fiction. Some critics find the resolutions a touch didactic, but for many readers the novel's compassion and clarity are precisely its virtues. Haig handles depression with imagination and respect, avoiding trite solutions while offering a story that insists value can be found in small, imperfect lives. In short, The Midnight Library is an inviting parable about learning to live with ourselves.",
    "totalPages": 304,
    "rating": 4.1,
    "category": "Contemporary / Speculative",
    "tags": ["Speculative", "Mental Health", "Philosophical", "Parable"],
    "publisher": "Canongate / Viking (US)",
    "yearOfPublishing": 2020
  },
  {
    "bookId": "B010",
    "bookName": "The Song of Achilles",
    "author": "Madeline Miller",
    "image": "https://www.bookup.com.mx/cdn/shop/files/9780063225350.png?v=1736577437&width=823",
    "review": "Madeline Miller's The Song of Achilles retells the myth of Achilles and Patroclus with tenderness and lyricism, staging their relationship as both heroic romance and tragic destiny. Told from Patroclus's point of view, the novel shifts classical spectacle into intimate, human scale: the rage of war and the tenderness of forbidden love coexist in scenes of training, exile, and battlefield glory. Miller's prose balances classical diction with contemporary emotional immediacy; she renders combat and longing with equal clarity. Importantly, the novel re-centers marginalized voices within myth, making the private economies of care—small gestures, shared stories—into what sustains heroism. Readers respond strongly to the book's emotional sincerity: it does not mythologize suffering as inevitable, but rather presents love as a defiant, shaping force. The ending is devastating because it feels earned, and the book lingers because it renders myth as living human consequence. A modern classic of mythic retelling, The Song of Achilles is both ardent and elegiac.",
    "totalPages": 352,
    "rating": 4.4,
    "category": "Myth Retelling / Historical Fiction",
    "tags": ["Myth", "Romance", "Historical", "Retelling"],
    "publisher": "Bloomsbury / Ecco (US)",
    "yearOfPublishing": 2011
  },
  {
    "bookId": "B011",
    "bookName": "The Overstory",
    "author": "Richard Powers",
    "image": "https://cdn2.wwnorton.com/wwnproducts/TRADE/7/8/9780393356687/9780393356687_300.jpeg",
    "review": "Richard Powers' The Overstory is a wide-angled, ambitious novel about trees, humans, and the chance connections that prompt activism. Through a mosaic of interlinked lives—scientists, veterans, artists, loggers—Powers constructs a multigenerational argument: that human stories are rooted in and inseparable from arboreal time. The novel alternates slow, meditative passages about botany and root networks with urgent, political episodes of protest and resistance. What distinguishes Powers is the care with which he renders nonhuman life: trees appear not merely as backdrop but as agents whose time scales and forms of intelligence challenge human exceptionalism. The prose can be dense, and the novel's structure is episodic, but those very features serve its purpose: to widen ethical imagination and ask readers to re-evaluate belonging. The Overstory won the Pulitzer Prize because it both insists and persuades: ecological awareness is not an accessory to moral life but its central test. This book is a call to attention—beautiful, frustrating, and powerful.",
    "totalPages": 512,
    "rating": 4.1,
    "category": "Literary Fiction / Eco-fiction",
    "tags": ["Environment", "Interconnectedness", "Activism", "Multi-voice"],
    "publisher": "W. W. Norton & Company",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "B012",
    "bookName": "The Underground Railroad",
    "author": "Colson Whitehead",
    "image": "https://images4.penguinrandomhouse.com/cover/9780345804327",
    "review": "Colson Whitehead's The Underground Railroad is a visceral, imaginative reworking of American history that blends brutal realism with a speculative conceit: Whitehead literalizes the Underground Railroad as an actual subterranean train. The story follows Cora, an enslaved woman who flees a Georgia plantation and pursues freedom through a string of states, each offering a different, often horrific arrangement of racial politics. Whitehead's prose is spare and precise, with jolting scenes of violence balanced by lyric meditations on history and memory. The speculative device allows the novel to traverse multiple styles—naturalism, allegory, historical reimagining—without losing narrative momentum. Whitehead interrogates the persistence of racial terror and the tenuousness of freedom, refusing easy consolation even in moments of escape. The book's originality and moral force won it the Pulitzer Prize and National Book Award, and it remains a powerful, necessary read: a work that challenges readers to confront the architecture of American injustice while honoring the courage of those who resisted it.",
    "totalPages": 320,
    "rating": 4.2,
    "category": "Historical / Speculative",
    "tags": ["Historical", "Race", "Speculative", "Freedom"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2016
  }
]
